@echo off
cls
echo ===================================================
echo [تحذير أمني من نظام التشغيل]
echo ===================================================
echo.
echo سيتم إيقاف تشغيل الجهاز تلقائيًا لحماية الموارد!
echo لديك 15 ثانية فقط لضغط أي زر وإلغاء الإغلاق الحتمي.
echo.

:: الانتظار لمدة 15 ثانية، وإذا ضغط المستخدم أي زر يتم تخطي الإغلاق
timeout /t 3
if ERRORLEVEL 1 ( ECHO YES ) ELSE ( ECHO NO )


:: أمر إيقاف تشغيل الكمبيوتر فورًا في حال انتهاء الـ 15 ثانية دون تدخل
@REM shutdown /s /t 0
pause